Hi @fmunozmiranda , below is the output from the resource creation with the debugs enabled. I tried executing the same with the autoimport enabled on the provider, but I see the same error.

This time it was the 'ndg_mm' resource that failed on the first run but sometimes, after destroying the resources and running the apply again, the 'ndg_lim' resource is the one that fails on the first run.

```
[grgibbs@fedora1 ise-policy]$ set -x ISE_DEBUG 'true'
set -x TF_LOG 'DEBUG'
+ set -x ISE_DEBUG true
+ set -x TF_LOG DEBUG
[grgibbs@fedora1 ise-policy]$ tf state list
+ terraform state list
[grgibbs@fedora1 ise-policy]$ tf apply --auto-approve
+ terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ciscoise_network_device_group.ndg_deployment_stage will be created
  + resource "ciscoise_network_device_group" "ndg_deployment_stage" {
      + id           = (known after apply)
      + item         = (known after apply)
      + last_updated = (known after apply)

      + parameters {
          + description = "Root Deployment Stage NDG"
          + id          = (known after apply)
          + link        = (known after apply)
          + name        = "Deployment Stage#Deployment Stage"
          + ndgtype     = "Deployment Stage"
        }
    }

  # ciscoise_network_device_group.ndg_lim will be created
  + resource "ciscoise_network_device_group" "ndg_lim" {
      + id           = (known after apply)
      + item         = (known after apply)
      + last_updated = (known after apply)

      + parameters {
          + description = "Low Impact Mode NDG"
          + id          = (known after apply)
          + link        = (known after apply)
          + name        = "Deployment Stage#Deployment Stage#Low Impact Mode"
          + ndgtype     = (known after apply)
        }
    }

  # ciscoise_network_device_group.ndg_mm will be created
  + resource "ciscoise_network_device_group" "ndg_mm" {
      + id           = (known after apply)
      + item         = (known after apply)
      + last_updated = (known after apply)

      + parameters {
          + description = "Monitor Mode NDG"
          + id          = (known after apply)
          + link        = (known after apply)
          + name        = "Deployment Stage#Deployment Stage#Monitor Mode"
          + ndgtype     = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
ciscoise_network_device_group.ndg_deployment_stage: Creating...
ciscoise_network_device_group.ndg_deployment_stage: Creation complete after 0s [id=id:=25a84400-6b7a-11ed-8070-8ef611c54348\name:=Deployment Stage#Deployment Stage]
ciscoise_network_device_group.ndg_mm: Creating...
ciscoise_network_device_group.ndg_lim: Creating...
ciscoise_network_device_group.ndg_lim: Creation complete after 0s [id=id:=25ba4560-6b7a-11ed-8070-8ef611c54348\name:=Deployment Stage#Deployment Stage#Low Impact Mode]
â•·
â”‚ Error: Failure when executing CreateNetworkDeviceGroup
â”‚ 
â”‚   with ciscoise_network_device_group.ndg_mm,
â”‚   on ndg.tf line 11, in resource "ciscoise_network_device_group" "ndg_mm":
â”‚   11: resource "ciscoise_network_device_group" "ndg_mm" {
â”‚ 
â”‚ error with operation CreateNetworkDeviceGroup
â”‚ {
â”‚   "ERSResponse" : {
â”‚     "operation" : "POST-create-networkdevicegroup",
â”‚     "messages" : [ {
â”‚       "title" : "Failed to create Network Device Group. Internal error.",
â”‚       "type" : "ERROR",
â”‚       "code" : "CRUD operation exception"
â”‚     } ],
â”‚     "link" : {
â”‚       "rel" : "related",
â”‚       "href" : "https://192.168.222.54:9060/ers/config/networkdevicegroup",
â”‚       "type" : "application/xml"
â”‚     }
â”‚   }
â”‚ }
â•µ
[grgibbs@fedora1 ise-policy]$ tf apply --auto-approve
+ terraform apply --auto-approve
ciscoise_network_device_group.ndg_deployment_stage: Refreshing state... [id=id:=25a84400-6b7a-11ed-8070-8ef611c54348\name:=Deployment Stage#Deployment Stage]
ciscoise_network_device_group.ndg_lim: Refreshing state... [id=id:=25ba4560-6b7a-11ed-8070-8ef611c54348\name:=Deployment Stage#Deployment Stage#Low Impact Mode]

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ciscoise_network_device_group.ndg_mm will be created
  + resource "ciscoise_network_device_group" "ndg_mm" {
      + id           = (known after apply)
      + item         = (known after apply)
      + last_updated = (known after apply)

      + parameters {
          + description = "Monitor Mode NDG"
          + id          = (known after apply)
          + link        = (known after apply)
          + name        = "Deployment Stage#Deployment Stage#Monitor Mode"
          + ndgtype     = "Deployment Stage"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
ciscoise_network_device_group.ndg_mm: Creating...
ciscoise_network_device_group.ndg_mm: Creation complete after 1s [id=id:=30b8c130-6b7a-11ed-8070-8ef611c54348\name:=Deployment Stage#Deployment Stage#Monitor Mode]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
[grgibbs@fedora1 ise-policy]$ tf state list
+ terraform state list
ciscoise_network_device_group.ndg_deployment_stage
ciscoise_network_device_group.ndg_lim
ciscoise_network_device_group.ndg_mm
[grgibbs@fedora1 ise-policy]$ 
```